app/Controllers/AdminController.php

SELECT *
FROM `users`
WHERE `users`.`id` = 4
---
    public function editUser($id)
    {
        $session = session();
        if (!$session->get('isLoggedIn') || strtolower((string) $session->get('role')) !== 'admin') {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();
        $user = $userModel->find((int) $id);