app/Controllers/AdminController.php

    public function dashboard()
    {
        $session = session();
        if (!$session->get('isLoggedIn') || strtolower((string) $session->get('role')) !== 'admin') {
            return redirect()->to('/auth/login');
        }

        $userModel    = new UserModel();
        $studentModel = new StudentModel();
        $db = Database::connect();

        // Totals
        $totalUsers = $userModel->countAllResults();
        $totalCourses = 0;
        try {
            if ($db->tableExists('courses')) {
                $totalCourses = (int) $db->table('courses')->countAll();
            }
        } catch (\Throwable $e) {
            $totalCourses = 0;
        }

        // Recent activity: latest 3 registered users
        $recentUsers = $userModel
            ->orderBy('created_at', 'DESC')
            ->select('name,email,role,created_at')
            ->limit(3)
            ->find();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows` FROM `courses`
SELECT `name`, `email`, `role`, `created_at`
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 3

            $initials = $first . $last;
        }

        $data = [
            'user' => [
                'name'  => $session->get('name'),
                'email' => $session->get('email'),
                'role'  => $session->get('role'),
            ],
            'adminUsers'    => $userModel->where('role', 'admin')->findAll(),
            'totalUsers'    => $totalUsers,
            'totalCourses'  => $totalCourses,
            'recentUsers'   => $recentUsers,
            'userInitials'  => $initials,
        ];
---
SELECT *
FROM `users`
WHERE `role` = 'admin'

    public function users()
    {
        $session = session();
        if (!$session->get('isLoggedIn') || strtolower((string) $session->get('role')) !== 'admin') {
            return redirect()->to('/auth/login');
        }

        $userModel = new UserModel();
        $users = $userModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC

    public function courses()
    {
        $session = session();
        if (!$session->get('isLoggedIn') || strtolower((string) $session->get('role')) !== 'admin') {
            return redirect()->to('/auth/login');
        }

        $db = Database::connect();
        $courses = [];
        try {
            if ($db->tableExists('courses')) {
                $courses = $db->table('courses')
                    ->select('id, title, code, unit, course_level, department, course_start_date, course_end_date, enrollment_start_date, enrollment_end_date, class_schedule, academic_year, start_date, end_date, instructor_id, created_at')
                    ->orderBy('created_at', 'DESC')
                    ->get()->getResultArray();
            }
        } catch (\Throwable $e) {
            $courses = [];
        }

        $userModel = new UserModel();
        $teachers = $userModel->where('role', 'teacher')->orderBy('name', 'ASC')->findAll();
---
SELECT `id`, `title`, `code`, `unit`, `course_level`, `department`, `course_start_date`, `course_end_date`, `enrollment_start_date`, `enrollment_end_date`, `class_schedule`, `academic_year`, `start_date`, `end_date`, `instructor_id`, `created_at`
FROM `courses`
ORDER BY `created_at` DESC
SELECT *
FROM `users`
WHERE `role` = 'teacher'
ORDER BY `name` ASC

        $programs = [];

        try {
            $departments = $departmentModel->orderBy('department_name', 'ASC')->findAll();
            $programs = $programModel->orderBy('program_name', 'ASC')->findAll();
---
SELECT *
FROM `departments`
ORDER BY `department_name` ASC
SELECT *
FROM `programs`
ORDER BY `program_name` ASC