app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'jerica@lms.com'
 LIMIT 1
---
    public function login()
    {
        // If user is already logged in, redirect to dashboard
        if ($this->session->get('user_id')) {
            return redirect()->to('/auth/dashboard');
        }

        $data = [];

        if ($this->request->getMethod() === 'POST') {
            // Validation rules
            $rules = [
                'email' => 'required|valid_email',
                'password' => 'required'
            ];

            if ($this->validate($rules)) {
                $email = $this->request->getPost('email');
                $password = $this->request->getPost('password');

                // Find user by email
                $user = $this->userModel->where('email', $email)->first();