app/Controllers/Course.php

    public function search()
    {
        $searchTerm = trim((string) ($this->request->getPost('search_term') ?? $this->request->getGet('search_term') ?? ''));
        $courseModel = new CourseModel();

        if ($searchTerm !== '') {
            $courseModel->groupStart()
                ->like('title', $searchTerm)
                ->orLike('description', $searchTerm)
                ->groupEnd();
        }

        $courses = $courseModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `courses`
ORDER BY `created_at` DESC