app/Controllers/StudentController.php

SELECT *
FROM `notifications`
WHERE `notifications`.`id` = 48
UPDATE `notifications` SET `is_read` = 1
WHERE `notifications`.`id` IN (48)
---
    public function markNotificationRead($notificationId = null)
    {
        $session = session();
        if (!$session->get('isLoggedIn') || !in_array(strtolower((string) $session->get('role')), ['student', 'user'], true)) {
            return $this->response->setJSON(['error' => 'Unauthorized']);
        }

        // Get notification ID from method parameter
        $notificationId = (int) $notificationId;
        $userId = (int) ($session->get('user_id') ?? 0);

        if ($notificationId <= 0) {
            return $this->response->setJSON(['error' => 'Invalid notification ID']);
        }

        try {
            $notificationModel = new NotificationModel();

            // Verify notification belongs to this user
            $notification = $notificationModel->find($notificationId);
            if (!$notification || $notification['user_id'] != $userId) {
                return $this->response->setJSON(['error' => 'Notification not found']);
            }

            $notificationModel->update($notificationId, ['is_read' => 1]);