app/Controllers/StudentController.php

    public function dashboard()
    {
        $session = session();
        $role = strtolower((string) $session->get('role'));
        // Authorization: student or generic user
        if (!$session->get('isLoggedIn') || !in_array($role, ['student', 'user'], true)) {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();

        $userId = (int) ($session->get('user_id') ?? 0);

        // Enrolled courses via EnrollmentModel join
        $enrolledCourses = [];
        try {
            $enrollmentModel = new EnrollmentModel();
            if ($userId > 0) {
                $enrolledCourses = $enrollmentModel->getUserEnrollments($userId);
            }
        } catch (\Throwable $e) {
            $enrolledCourses = [];
        }

        // Available courses: all courses in the system (student can choose which to enroll)
        $availableCourses = [];
        try {
            $db = Database::connect();
            if ($db->tableExists('courses')) {
                $availableCourses = $db->table('courses')
                    ->select('id, title, code, unit')
                    ->orderBy('id', 'DESC')
                    ->get()->getResultArray();
---
SELECT `id`, `title`, `code`, `unit`
FROM `courses`
ORDER BY `id` DESC