app/Controllers/TeacherController.php

    public function dashboard()
    {
        $session = session();
        // Authorization: teacher/instructor only
        $role = strtolower((string) $session->get('role'));
        if (!$session->get('isLoggedIn') || !in_array($role, ['teacher', 'instructor'], true)) {
            return redirect()->to('/login');
        }

        $userId = (int) ($session->get('user_id') ?? 0);

        $db = Database::connect();

        // Courses in the system (shown on teacher dashboard)
        $courses = [];
        try {
            if ($db->tableExists('courses')) {
                $coursesRows = $db->table('courses')
                    ->select('id, title, code, unit, instructor_id')
                    ->orderBy('id', 'DESC')
                    ->get()->getResultArray();
---
SELECT `id`, `title`, `instructor_id`
FROM `courses`
WHERE `instructor_id` = 2
ORDER BY `id` DESC

        $submissions = [];
        try {
            if ($db->tableExists('submissions')) {
                $subsRows = $db->table('submissions')
                    ->select('*')
                    ->orderBy('created_at', 'DESC')
                    ->limit(5)
                    ->get()->getResultArray();
---
SELECT *
FROM `submissions`
ORDER BY `created_at` DESC
 LIMIT 5