app/Models/EnrollmentModel.php

SELECT `courses`.*, `enrollments`.`enrollment_date`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = 3
ORDER BY `enrollments`.`enrollment_date` DESC
---
    public function getUserEnrollments(int $user_id): array
    {
        return $this->select('courses.*, enrollments.enrollment_date, enrollments.enrollment_status')
            ->join('courses', 'courses.id = enrollments.course_id')
            ->where('enrollments.user_id', $user_id)
            ->orderBy('enrollments.enrollment_date', 'DESC')
            ->findAll();