app/Models/NotificationModel.php

    public function getUnreadCount(int $userId): int
    {
        return $this->where(['user_id' => $userId, 'is_read' => 0])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 1
AND `is_read` = 0

    public function getNotificationsForUser(int $userId): array
    {
        return $this->where(['user_id' => $userId, 'is_read' => 0])
            ->orderBy('created_at', 'DESC')
            ->findAll(10); // Increased from 5 to 10
---
SELECT *
FROM `notifications`
WHERE `user_id` = 3
AND `is_read` = 0
ORDER BY `created_at` DESC
 LIMIT 5